heights_input = input(
                    """
                    Введіть висоту кожної з трьох частин ялинки.
                    Три цілих числа через пробіл починаючи з верхньоъ частини.
                    Увага! числа мають бути більше за 2. Наприклад:  -> 4 3 7
                    -> """
                    ).split()

heights = [int(el) for el in heights_input] 
# heights.sort()

#
#       Аналіз даних з метою вирахувати ширину ялинки
#  Кожний рядок додає 2 до довжини попереднього рядка.
#  Тобто ширина першого низу буде: 
#         2 + 2 * "кількість_рядків_1"    
# для першої частини.
# Зменшуємо цю шрину на 2 з кожного краю для краси. Маємо: 
#         2 + 2 * "кількість_рядків_1" - 4
# Другий крок починається з цієї ширини і додає ще 
#         2 * "кількість_рядків_2" 
# рядків. Знову віднімаємо 4 зірочки (по 2 з краю). 
# Тоді початкова ширина третьої частини буде: 
#         2 + 2 * "кількість_рядків_1" - 4  +  2 * "кількість_рядків_2" - 4
# а "низ" третьої частинии буде дорівнювати: 
#         2 + 2 * "кількість_рядків_1" - 4   \
#           + 2 * "кількість_рядків_2" - 4   \
#           + 2 * "кількість_рядків_3"  
#         
par_centre, i = 2, 0
bottom_widths = [ ]
for height in heights:
    bottom_width = par_centre + 2 * height
    bottom_widths.append(bottom_width)
    par_centre = bottom_width - 4
else:  # як цього уникнути ??
    par_centre += 4 
#  par_centre = max(heights) * 2

s = '**'   # ширина першого верху - 2
for i, height in enumerate(heights):
    # Друк наступної частини ялинки
    for _ in range(height):
        print(s.center(par_centre))
        s += "**"
    s = (bottom_widths[i] - 4) * '*'

# Друк ніжки ялинки
print("||".center(par_centre))